---
type: PanelTypeSet
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# PanelTypeSet

`Autodesk.Revit.DB.PanelTypeSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PanelTypeSet | — | `public PanelTypeSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( PanelType item )` |
| Method | Erase | — | `public virtual int Erase ( PanelType item )` |
| Method | ForwardIterator | — | `public virtual PanelTypeSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( PanelType item )` |
| Method | ReverseIterator | — | `public virtual PanelTypeSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |